app/controllers/movies_controller.rb

SELECT "movies".* FROM "movies" WHERE "movies"."rating" IN ('G', 'PG', 'PG-13', 'R') AND "movies"."order" = 'title'
---
  def index
    @all_ratings = Movie.all_ratings

    @sort = params[:sort]
    if params.has_key?(:ratings)
      @ratings_filter = params[:ratings].keys
    elsif params.has_key?(:ratings_filter)
      @ratings_filter = params[:ratings_filter]
    else
      @ratings_filter = @all_ratings
    end

    case @sort
    when "title"
      @movies = Movie.where(rating: @ratings_filter).find(:all, :order => "title") #.find(:all, :order => "title")